app/views/users/show.html.erb

SELECT "billings".* FROM "billings" WHERE "billings"."user_id" = ?  [["user_id", 1]]
---
      <tbody>
        <% current_user.billings.each do |billing| %>