app/views/billings/edit.html.erb

          <datalist id="type_autocomplete">
            <% Type.all.each do |type| %>
---
SELECT "types".* FROM "types"