app/controllers/application_controller.rb

  def current_user
    @user = User.find_by(email: session[:user_email]) || User.new
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "as510891328@gmail.com"], ["LIMIT", 1]]