app/controllers/billings_controller.rb

SELECT "billings".* FROM "billings" WHERE "billings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @billing = Billing.find(params[:id])

INSERT INTO "billings" ("user_id", "type_id", "created_at", "updated_at", "description", "date", "fix_or_var") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 2], ["type_id", 1], ["created_at", "2020-09-29 21:26:43.631961"], ["updated_at", "2020-09-29 21:26:43.631961"], ["description", "asd"], ["date", "2020-09-29"], ["fix_or_var", "fixed"]]
---
  def create
    @billing = current_user.billings.create(billing_params)
    return render :new unless @billing.save

SELECT "billings".* FROM "billings" WHERE "billings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @billing = Billing.find(params[:id])

SELECT "billings".* FROM "billings" WHERE "billings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "billings" SET "fix_or_var" = ?, "updated_at" = ? WHERE "billings"."id" = ?  [["fix_or_var", "variable"], ["updated_at", "2020-09-29 21:45:17.174713"], ["id", 2]]
---
  def update
    @billing = Billing.find(params[:id])
    @billing.update(billing_params)
    return render :edit unless @billing.save

SELECT "billings".* FROM "billings" WHERE "billings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "billings" WHERE "billings"."id" = ?  [["id", 2]]
---
  def destroy
    @billing = Billing.find(params[:id])
    @billing.delete