app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "as510891328@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = User.find(email: params[:user][:email])