app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.create(user_params)

UPDATE "users" SET "name" = ?, "password_digest" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "a"], ["password_digest", "$2a$12$VRbLpmC/Krcct99OB/OzwuvY53Y2m7C4/hUPLdXSywX7PVICjlwZS"], ["email", "a@a.com"], ["updated_at", "2020-09-29 22:52:38.481441"], ["id", 3]]
---
  def update
    @user = current_user
    @user.update(user_params)