app/models/billing.rb

  def type_name=(name)
    self.type = Type.find_or_create_by(name: name)
---
INSERT INTO "types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "abcdefg"], ["created_at", "2020-09-29 21:08:23.878817"], ["updated_at", "2020-09-29 21:08:23.878817"]]
SELECT "types".* FROM "types" WHERE "types"."name" = ? LIMIT ?  [["name", "rent"], ["LIMIT", 1]]